{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "kernel_regularizer": null, "batch_input_shape": [null, 30], "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 18, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "kernel_regularizer": null, "name": "dense_4", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 24, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "kernel_regularizer": null, "name": "dense_5", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}], "keras_version": "2.0.5"}